Ran Plan for dir: `terraform/users` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.admin1.random_password.password will be created
+ resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 25
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.admin1.vault_generic_endpoint.user will be created
+ resource "vault_generic_endpoint" "user" {
      + data_json            = (sensitive value)
      + disable_delete       = false
      + disable_read         = false
      + id                   = (known after apply)
      + ignore_absent_fields = true
      + path                 = "auth/userpass/users/admin1"
      + write_data           = (known after apply)
      + write_data_json      = (known after apply)
    }

  # module.admin1.vault_generic_secret.user will be created
+ resource "vault_generic_secret" "user" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "users/admin1"
    }

  # module.admin1.vault_identity_entity.user will be created
+ resource "vault_identity_entity" "user" {
      + disabled          = false
      + external_policies = false
      + id                = (known after apply)
      + metadata          = {
          + "email"      = "kbot-email@your-company.io"
          + "first_name" = "Kubefirst"
          + "last_name"  = "Bot"
        }
      + name              = "admin1"
    }

  # module.admin1.vault_identity_entity_alias.user will be created
+ resource "vault_identity_entity_alias" "user" {
      + canonical_id   = (known after apply)
      + id             = (known after apply)
      + mount_accessor = "auth_userpass_a923c25e"
      + name           = "admin1"
    }

  # module.kbot.vault_generic_endpoint.user will be updated in-place
~ resource "vault_generic_endpoint" "user" {
      ~ data_json            = (sensitive value)
        id                   = "auth/userpass/users/kbot"
        # (6 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/users`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.kubefirst.dev/lock?id=johndietz%252Fgitops%252Fterraform%252Fusers%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/users`
</details>
Plan: 5 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`